bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA165P.xml
            <value-group caption="" name="ENUM_BOOTSZ">
                <value caption="Boot Flash size=128 words start address=$1F80" name="128W_1F80" value="0x03"/>
                <value caption="Boot Flash size=256 words start address=$1F00" name="256W_1F00" value="0x02"/>
                <value caption="Boot Flash size=512 words start address=$1E00" name="512W_1E00" value="0x01"/>
                <value caption="Boot Flash size=1024 words start address=$1C00" name="1024W_1C00" value="0x00"/>
            </value-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out Detection Disabled" name="DISABLED" value="0x07"/>
                <value caption="Brown-out Detection at VCC=1.8 V" name="1V8" value="0x06"/>
                <value caption="Brown-out Detection at VCC=2.7 V" name="2V7" value="0x05"/>
                <value caption="Brown-out Detection at VCC=4.3 V" name="4V3" value="0x04"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB">
                <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB2">
                <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 8-bit" name="TC8">
            <register-group caption="Timer/Counter, 8-bit" name="TC0">
                <register caption="Timer/Counter0 Control Register" name="TCCR0A" offset="0x44" size="1">
                    <bitfield caption="Force Output Compare" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Waveform Generation Mode 0" mask="0x40" name="WGM00" values="WAVEFORM_GEN_MODE"/>
                    <bitfield caption="Compare Match Output Modes" mask="0x30" name="COM0A"/>
                    <bitfield caption="Waveform Generation Mode 1" mask="0x08" name="WGM01"/>
                    <bitfield caption="Clock Selects" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match Interrupt Enable" mask="0x02" name="OCIE0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x35" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter0 Output Compare Flag 0" mask="0x02" name="OCF0A"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="General Timer/Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSR10"/>
                </register>
            </register-group>
            <value-group caption="" name="WAVEFORM_GEN_MODE">
                <value caption="Normal" name="VAL_0x00" value="0x00"/>
                <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
                <value caption="CTC" name="VAL_0x01" value="0x01"/>
                <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter 1 Control Register C" name="TCCR1C" offset="0x82" size="1">
                    <bitfield caption="Force Output Compare 1A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare 1B" mask="0x40" name="FOC1B"/>
                </register>
