bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA165P.xml
            <value-group caption="" name="COMM_USART_MODE">
                <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
                <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
            </value-group>
            <value-group caption="" name="COMM_UPM_PARITY_MODE">
                <value caption="Disabled" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
                <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="COMM_STOP_BIT_SEL">
                <value caption="1-bit" name="VAL_0x00" value="0x00"/>
                <value caption="2-bit" name="VAL_0x01" value="0x01"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Power Reduction Register" name="PRR" offset="0x64" size="1">
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
                    <bitfield caption="Power Reduction USART" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS2"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS2">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Reserved" name="VAL_0x07" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>

        </module>
    </modules>
</target-description-file>
